# <center><u>Pandas <u> </center>

## 1.[Pandas Series](https://pandas.pydata.org/pandas-docs/stable/reference/series.html)

Import pandas and numpy with their aliases

In [1]:
import numpy as np
import pandas as pd

Create a variable a = pd.Series([ 100, 200, 300, 400])

In [2]:
a = pd.Series([100,200,300,400])

Print a, and data type

In [3]:
print(a)
print(type(a))

0    100
1    200
2    300
3    400
dtype: int64
<class 'pandas.core.series.Series'>

Using indexing access the element 300 from the series a.

In [4]:
a[2]

300

What are the values of index for series a?

In [5]:
a.index

RangeIndex(start=0, stop=4, step=1)

Change the index to  ['c', 'a', 'b', 'd']

In [6]:
a.index = ['c','a','b','d']
a

c    100
a    200
b    300
d    400
dtype: int64

Access the value in the series with index 'd'

In [7]:
a['d']

400

Sort the values wrt to the index and print it

In [8]:
a = a.sort_index()
a

a    200
b    300
c    100
d    400
dtype: int64

Create a new Pandas Series b having index as 'e', 'f', and 'g' and value 800,450,100 and print it

In [9]:
b= pd.Series([800,450,100], index = ['e','f','g'])
b

e    800
f    450
g    100
dtype: int64

Append b series at the end of a series

In [10]:
a = a.append(b)

In [11]:
#print a again after appending b into it
a

a    200
b    300
c    100
d    400
e    800
f    450
g    100
dtype: int64

Sort the values in descending order of a and print the index of the sorted series

In [12]:
a= a.sort_values(ascending= False)

In [13]:
# print index of a

a.index

Index(['e', 'f', 'd', 'b', 'a', 'g', 'c'], dtype='object')

## 2. [Pandas DataFrame](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html)

### Part 1

Create a pandas dataframe df from the series 'a' that we used in the last section, print the dataframe

In [14]:
df = pd.DataFrame(a)
df

     0
e  800
f  450
d  400
b  300
a  200
g  100
c  100

Point to ponder! Don't you think series a and dataframe df looks alike? But there must be some difference between them. 
Hey buddy think and write your thoughts below.

In [15]:
# happy to know your comment

"""Series can contain only one list or one column, where as dataframe can be made of more than one series or multiple column"""

'Series can contain only one list or one column, where as dataframe can be made of more than one series or multiple column'

What is the shape of the datafarme <br>

In [16]:
df.shape

(7, 1)

Hey! remember shape (7,1) implies dataframe has 7 rows and 1 column.

What is the index of the dataframe, is it same as the series 'a' ?

In [17]:
df.index

Index(['e', 'f', 'd', 'b', 'a', 'g', 'c'], dtype='object')

print the head and tail of the dataframe. <br>
Additional - (what does head and tali represent?)

In [18]:
#head
df.head()

     0
e  800
f  450
d  400
b  300
a  200

In [ ]:
#tail
df.tail()

     0
d  400
b  300
a  200
g  100
c  100

Rename the columns of the dataframe as 'points'

In [19]:
df = df.rename(columns= {0 :'points'})
df

   points
e     800
f     450
d     400
b     300
a     200
g     100
c     100

Create another Series 'fruits', which contains random names of fruits from ['orange','mango','apple']. The series should contain 7 elements, randomly selected from ['orange','mango','apple']

In [20]:
#Create fruits array
fruits = np.array(['orange', 'orange', 'mango', 'mango', 'mango', 'mango', 'mango'])
fruits

array(['orange', 'orange', 'mango', 'mango', 'mango', 'mango', 'mango'],
      dtype='<U6')

In [21]:
#Create series fruits out of fruits array
fruits = pd.Series(fruits)
fruits

0    orange
1    orange
2     mango
3     mango
4     mango
5     mango
6     mango
dtype: object

Change the index of fruits to the index of dataframe df

In [22]:
fruits.rename(index= {0:'e',1:'f',2:'d',3:'b',4:'a',5:'g',6:'c'})

e    orange
f    orange
d     mango
b     mango
a     mango
g     mango
c     mango
dtype: object

Add this fruits series as a new column to the dataframe df with its column name as 'fruits' <br> print the head of the dataframe to verify

In [23]:
df = df.assign( fruits =  fruits.values)
df

   points  fruits
e     800  orange
f     450  orange
d     400   mango
b     300   mango
a     200   mango
g     100   mango
c     100   mango


What if we had to changed the index of the dataframe? <br>
Try to add any series to the dataframe with the origianl index (when index of series is not same as to the index of dataframe)

Use series as pd.Series([100,200,300,400,500,600,700]) and try to add it to df with column name Bonus_number.

In [24]:
#bonus code here
Bonus_number = pd.Series([100,200,300,400,500,600,700])
df = df.assign(Bonus_no = Bonus_number.values)
df

   points  fruits  Bonus_no
e     800  orange       100
f     450  orange       200
d     400   mango       300
b     300   mango       400
a     200   mango       500
g     100   mango       600
c     100   mango       700

### Part 2

Create a dataframe  d1 where the columns are  ‘city’ : [‘Chandigarh’, ‘Delhi’, ‘Kanpur’, ‘Chennai’, ‘Manali’ ] and ‘Temperature’ : [15, 22, 20, 26,-2]

In [25]:
d1 = pd.DataFrame({'city' :['Chandigarh','Delhi','Kanpur','Chennai','Manali'],'Temperature' :[15,22,20,26,-2]})

Print d1

In [26]:
d1

         city  Temperature
0  Chandigarh           15
1       Delhi           22
2      Kanpur           20
3     Chennai           26
4      Manali           -2

What is the shape of d1.

In [27]:
d1.shape

(5, 2)

Set city = d1['city']

In [28]:
city = d1['city']

print city <br>
What is the type of city.

In [29]:
print(city)
type(city)

0    Chandigarh
1         Delhi
2        Kanpur
3       Chennai
4        Manali
Name: city, dtype: object

pandas.core.series.Series

Create another dataframe d2 where the columns are <br>
'city' - ['Bengalaru','Coimbatore','Srirangam','Pondicherry'] <br>
'Temperature' - [24,35,36,39]

In [30]:
d2 = pd.DataFrame({'city':['Bengalaru','Coimbatore','Srirangam','Pondicherry'],'Temperature':[24,35,36,39]})
d2

          city  Temperature
0    Bengalaru           24
1   Coimbatore           35
2    Srirangam           36
3  Pondicherry           39

print the shape of this dataframe

In [31]:
d2.shape

(4, 2)

merge the two dataframes together, save it in a new dataframe named 'd3'

In [54]:
d3 = pd.concat([d1,d2])
d3

          city  Temperature
0   Chandigarh           15
1        Delhi           22
2       Kanpur           20
3      Chennai           26
4       Manali           -2
0    Bengalaru           24
1   Coimbatore           35
2    Srirangam           36
3  Pondicherry           39

# fun fact at high level

1. .concat() simply stacks multiple DataFrame together either vertically, or stitches horizontally after aligning on index
2. .merge() first aligns two DataFrame' selected common column(s) or index, and then pick up the remaining columns from the aligned rows of each DataFrame

Select the part of the dataframe such that it contains cities where temp is less then or equal to 20 <br>
How many cities are there?

In [33]:
d_sub = d3[d3['Temperature'] <= 20]
d_sub

         city  Temperature
0  Chandigarh           15
2      Kanpur           20
4      Manali           -2

Select the part of the dataframe such that it contains the cities where tempearature greater than or equal to 35

In [34]:
d_sub1 = d3[d3['Temperature'] >= 35]
d_sub1

          city  Temperature
1   Coimbatore           35
2    Srirangam           36
3  Pondicherry           39

## 3. Applying functions to columns and creating new columns

We need to create another column in d3, which contains  a boolean value for each city to indicate whether it's a union territory or not. 
- HINT: Chandigarh, Pondicherry and Delhi are only 3 union territories here.

In [52]:
# write function here
def is_ut(city):
  if (city == 'Chandigarh') | (city == 'Pondicherry') | (city == 'Delhi'):
    return True
  else:
    return False

In [55]:
#print d3
d3['is_ut'] = d3.apply(lambda x: is_ut(x['city']), axis = 1)
d3

          city  Temperature  is_ut
0   Chandigarh           15   True
1        Delhi           22   True
2       Kanpur           20  False
3      Chennai           26  False
4       Manali           -2  False
0    Bengalaru           24  False
1   Coimbatore           35  False
2    Srirangam           36  False
3  Pondicherry           39   True

The temperatures mentioned in ‘Temperature’ column are mentioned in Celsius, we need another column which contains the same in Fahrenheit.

HINT - 
- Define a function c_to_f which takes input temp in celsius and returns a value with temperature in Fahrenheit.
- To check: c_to_f(10) should return 50.

In [41]:
# write function here
def c_to_f(n):
  n = (n*1.8) + 32
  return n

In [42]:
# check  function c_to_f(10)
c_to_f(10)

50.0

In [56]:
# apply function c_to_f to d3 to create a column 'temp_farenhiet'

d3['temp_farenhiet'] = d3.apply( lambda x: c_to_f(x['Temperature']), axis = 1)
d3

          city  Temperature  is_ut  temp_farenhiet
0   Chandigarh           15   True            59.0
1        Delhi           22   True            71.6
2       Kanpur           20  False            68.0
3      Chennai           26  False            78.8
4       Manali           -2  False            28.4
0    Bengalaru           24  False            75.2
1   Coimbatore           35  False            95.0
2    Srirangam           36  False            96.8
3  Pondicherry           39   True           102.2

## 4. Indexing and selecting rows in DataFrame

Select subset of the dataframe d3 such that it contains the cities which are union territories.

In [58]:
sub_d3 = d3[d3['is_ut'] == True]
sub_d3

          city  Temperature  is_ut  temp_farenhiet
0   Chandigarh           15   True            59.0
1        Delhi           22   True            71.6
3  Pondicherry           39   True           102.2

Select a subset of the dataframe d3 such that it contains the cities which only have temperature above 90 Farenhiet.

In [59]:
sub1_d3 = d3[d3['temp_farenhiet'] > 90]
sub1_d3

          city  Temperature  is_ut  temp_farenhiet
1   Coimbatore           35  False            95.0
2    Srirangam           36  False            96.8
3  Pondicherry           39   True           102.2

Select only the first three rows of the dataframe d3.

In [60]:
d3.head(3)

         city  Temperature  is_ut  temp_farenhiet
0  Chandigarh           15   True            59.0
1       Delhi           22   True            71.6
2      Kanpur           20  False            68.0

Select all the rows and last two columns in the dataframe.

In [63]:
d3.iloc[:,2:]

   is_ut  temp_farenhiet
0   True            59.0
1   True            71.6
2  False            68.0
3  False            78.8
4  False            28.4
0  False            75.2
1  False            95.0
2  False            96.8
3   True           102.2

## 5. Reading csv file and group by

Read the file 'weather_data.csv' and store it in a pandas dataframe 'df'

In [64]:
# for google colab use this code
from google.colab import files
uploaded = files.upload()
import io
df = pd.read_csv(io.BytesIO(uploaded['weather_data.csv']))

Saving weather_data.csv to weather_data.csv

In [ ]:
# for jupyter notebook use this code
df = pd.read_csv('weather_data.csv')

print the shape and head of the dataframe

In [67]:
print(df.shape)
df.head()

(6, 4)

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain

Group the dataframe wrt to 'event' and save the resulting output in a variable named 'g'

In [68]:
g = df.groupby(by='event')

Print g and  type(g)

In [70]:
print(g)
print(type(g))

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x7f385fb63ad0>
<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

Iterate over all the temperatures in g and print them

In [72]:
for i in g:
  print(i)

('Rain',         day  temperature  windspeed event
0  1/1/2017           32          6  Rain
4  1/5/2017           32          4  Rain)
('Snow',         day  temperature  windspeed event
2  1/3/2017           28          2  Snow
3  1/4/2017           24          7  Snow)
('Sunny',         day  temperature  windspeed  event
1  1/2/2017           35          7  Sunny
5  1/6/2017           31          2  Sunny)

Use the describle method on g to get the complete description on it.

In [73]:
g.describe()

      temperature                              ... windspeed
            count  mean       std   min   25%  ...       min   25%  50%   75%  max
event                                          ...
Rain          2.0  32.0  0.000000  32.0  32.0  ...       4.0  4.50  5.0  5.50  6.0
Snow          2.0  26.0  2.828427  24.0  25.0  ...       2.0  3.25  4.5  5.75  7.0
Sunny         2.0  33.0  2.828427  31.0  32.0  ...       2.0  3.25  4.5  5.75  7.0

[3 rows x 16 columns]

Create a new column in the dataframe df, named 'hot_temp' which contains True if temp is above 30, else False

In [77]:
#code here to filter df with above condition
df['hot_temp'] = df.apply(lambda x: True if (x['temperature']>30) else False, axis = 1)

In [78]:
# print df
df

        day  temperature  windspeed  event  hot_temp
0  1/1/2017           32          6   Rain      True
1  1/2/2017           35          7  Sunny      True
2  1/3/2017           28          2   Snow     False
3  1/4/2017           24          7   Snow     False
4  1/5/2017           32          4   Rain      True
5  1/6/2017           31          2  Sunny      True

## Data Range

Create a pandas daterange where starting date is 1st of January,2020 and end date is 1st of April 2021, store it in a new variable named 'a'

In [79]:

a = pd.date_range(start = '2020-01-01', end= '2021-04-01')

print a

In [80]:
a

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06', '2020-01-07', '2020-01-08',
               '2020-01-09', '2020-01-10',
               ...
               '2021-03-23', '2021-03-24', '2021-03-25', '2021-03-26',
               '2021-03-27', '2021-03-28', '2021-03-29', '2021-03-30',
               '2021-03-31', '2021-04-01'],
              dtype='datetime64[ns]', length=457, freq='D')

What is the len of a?

In [81]:
len(a)

457

What is the type of a?

In [82]:
type(a)

pandas.core.indexes.datetimes.DatetimeIndex

## Create a game which generates one random number between 1 to 100 and gives user 5 chance to guess the correct number. After every attempt, print the number of attempt left.

In [ ]:
n = np.random.randint(1,100.1)
attempt = 1
print("Lets Play Jackpot")
print("Total No of attempt is 5")
while (attempt<=5):
    inp = int(input("Enter your number to hit JACKPOT: "))
    if inp > n:
        print("Ohh! your number is greater than the JACKPOT Number")
    elif inp < n:
        print("Ohh!!, your number is less than JACKPOT Number ")
    else:
        print("BINGO!!!, you have hit the JACKPOT")
        break
    print(5-attempt,"no. of attempt left")
    attempt = attempt + 1

if(attempt>5):
    print("Game Over")
    print("Jackpot Number ", n)